In [1]:
sub_list = ['math', 'english', 'science', 'history']
score_list = [87, 94, 85, 92]
Fscore_list = [i + 4 for i in score_list]

In [3]:
import pandas as pd

df2 = pd.DataFrame([score_list, Fscore_list], index = ['M_scr', 'F_scr'], columns = sub_list)
df2

       math  english  science  history
M_scr    87       94       85       92
F_scr    91       98       89       96

In [4]:
df2['math']

M_scr    87
F_scr    91
Name: math, dtype: int64

In [5]:
df2[['math']]

       math
M_scr    87
F_scr    91

In [6]:
df2['science']

M_scr    85
F_scr    89
Name: science, dtype: int64

In [8]:
df2.loc['M_scr']

math       87
english    94
science    85
history    92
Name: M_scr, dtype: int64

In [9]:
df2.loc[['M_scr']]

       math  english  science  history
M_scr    87       94       85       92

In [10]:
df2.reset_index(inplace = True)

In [11]:
df2

   index  math  english  science  history
0  M_scr    87       94       85       92
1  F_scr    91       98       89       96

In [12]:
df2.reset_index()

   level_0  index  math  english  science  history
0        0  M_scr    87       94       85       92
1        1  F_scr    91       98       89       96

In [14]:
el_0']

AttributeError: __delitem__